#### Series
- one dimensional array like object containing a sequence of values and an array of associated data labels called its index

In [16]:
import pandas as pd
import numpy as np
sep ='\n-------------------------------------------------------------------------------\n'
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
#create with a custom index
obj2 = pd.Series([4, 7,-5,3], index=['d', 'b', 'a', 'c'])
obj2
obj2.index
obj2[['c','d']]

c    3
d    4
dtype: int64

In [15]:
#filtering with a boolean array
print(f' obj2[obj2 >0]:\n {obj2[obj2 >0]}')
print(sep)
print(f'obj2 *5:\n {obj2*5}')

 obj2[obj2 >0]:
 d    4
b    7
c    3
dtype: int64

-------------------------------------------------------------------------------

obj2 *5:
 d    20
b    35
a   -25
c    15
dtype: int64

In [20]:
#Creating a series from a dictionary
# notice that the index is the dictionary's key and it is in sorted order
sdata = {'London':35000, 'Manchester':71000, 'Liverpool': 1600,  'Glasgow':5000, "Brighton":None }

obj3 = pd.Series(sdata)
obj3

London        35000.0
Manchester    71000.0
Liverpool      1600.0
Glasgow        5000.0
Brighton          NaN
dtype: float64

In [24]:
#detecting missing data
pd.notnull(obj3)

pd.isnull(obj3)

London        False
Manchester    False
Liverpool     False
Glasgow       False
Brighton       True
dtype: bool

In [25]:
#DataFrame
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [27]:
#get first five rows
firstFive = frame.head(5)
firstFive

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [28]:
#Data Frame with specified columns

pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [32]:
#passing a non extent column adds a column with missing data

frame2 =pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                     index = ['one', 'two', 'three', 'four','fve', 'six'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
fve    2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN